### Terraform Plan Results:
```
random_id.bucket_id: Refreshing state... [id=DLnwNg]
random_id.bucket_suffix: Refreshing state... [id=IUUDkg]
aws_iam_role.ec2_role: Refreshing state... [id=terraform_iam_role]
aws_s3_bucket.tf_state_bucket: Refreshing state... [id=my-unique-tfstate-bucket-1234]
data.aws_ami.amazon_linux_2: Reading...
aws_s3_bucket.kafka_bucket: Refreshing state... [id=kafka-bucket-0cb9f036]
aws_vpc.main: Refreshing state... [id=vpc-05ed0a2afe2724e13]
aws_s3_bucket.example: Refreshing state... [id=my-example-bucket-21450392]
aws_iam_policy.terraform_policy: Refreshing state... [id=arn:aws:iam::703671893205:policy/terraform_full_access_policy]
aws_dynamodb_table.tf_lock_table: Refreshing state... [id=terraform-lock-table]
aws_iam_role_policy_attachment.attach_terraform_policy: Refreshing state... [id=terraform_iam_role-20250222190645536000000001]
aws_iam_instance_profile.ec2_instance_profile: Refreshing state... [id=terraform_instance_profile]
aws_s3_bucket_public_access_block.bucket_block: Refreshing state... [id=kafka-bucket-0cb9f036]
aws_s3_bucket_public_access_block.tf_state_bucket_block: Refreshing state... [id=my-unique-tfstate-bucket-1234]
data.aws_ami.amazon_linux_2: Read complete after 1s [id=ami-0c104f6f4a5d9d1d5]
aws_security_group.allow_customip: Refreshing state... [id=sg-09a39cb2cb394d094]
aws_subnet.public: Refreshing state... [id=subnet-064b2fa8425e5b9b6]
aws_internet_gateway.igw: Refreshing state... [id=igw-07e5400c533247667]
aws_route_table.public: Refreshing state... [id=rtb-0d15564cb3b378d48]
aws_instance.web: Refreshing state... [id=i-00db76b7c6743caa9]
aws_instance.jenkins-runner: Refreshing state... [id=i-09618af6a96474ccc]
aws_route_table_association.public_assoc: Refreshing state... [id=rtbassoc-08b3f4848f6a8e104]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_instance.web has changed
  ~ resource "aws_instance" "web" {
        id                                   = "i-00db76b7c6743caa9"
      + public_ip                            = "98.82.191.60"
        tags                                 = {
            "Name" = "web-instance"
        }
        # (39 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.example3 will be created
  + resource "aws_s3_bucket" "example3" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "my-example-bucket3-21450392"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "Test"
          + "Name"        = "ExampleS3Bucket"
        }
      + tags_all                    = {
          + "Environment" = "Test"
          + "Name"        = "ExampleS3Bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning {
          + enabled    = false
          + mfa_delete = false
        }

      + website (known after apply)
    }

  # aws_s3_bucket.example4 will be created
  + resource "aws_s3_bucket" "example4" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "my-example-bucket4-21450392"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "Test"
          + "Name"        = "ExampleS4Bucket"
        }
      + tags_all                    = {
          + "Environment" = "Test"
          + "Name"        = "ExampleS4Bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning {
          + enabled    = false
          + mfa_delete = false
        }

      + website (known after apply)
    }

  # aws_s3_bucket.example5 will be created
  + resource "aws_s3_bucket" "example5" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "my-example-bucket5-21450392"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "Test"
          + "Name"        = "ExampleS4Bucket"
        }
      + tags_all                    = {
          + "Environment" = "Test"
          + "Name"        = "ExampleS4Bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning {
          + enabled    = false
          + mfa_delete = false
        }

      + website (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ ec2_instance_public_ip = "" -> "98.82.191.60"

Warning: Argument is deprecated

  with aws_s3_bucket.tf_state_bucket,
  on s3-lock.tf line 1, in resource "aws_s3_bucket" "tf_state_bucket":
   1: resource "aws_s3_bucket" "tf_state_bucket" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 20 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```